base
linux
linux-firmware
amd-ucode

base-devel
bash-completion
man-db
man-pages
e2fsprogs
dosfstools
git

xorg-server
xorg-xinit
xclip
xsel

xf86-video-amdgpu
mesa
vulkan-radeon
libva-mesa-driver
mesa-vdpau

qtile
networkmanager
vim
neovim

noto-fonts
noto-fonts-emoji
noto-fonts-cjk
