# Base Packages
base
linux
linux-firmware
amd-ucode
man-db
man-pages

# Dev Packages
base-devel
python
zsh
bash-completion
git
mesa-utils
vulkan-tools
docker
docker-compose

# Utilities
unzip
unrar
curl
wget
nano
vim
neovim
tmux
tree
feh
htop

# System Packages
xorg
xclip
xsel
wl-clipboard
pipewire
pipewire-audio
pipewire-alsa
pipewire-pulse
wireplumber
bluez
bluez-utils
polkit
e2fsprogs
dosfstools
flatpak
xdg-desktop-portal
xdg-desktop-portal-gtk

# Drivers
xf86-video-amdgpu
mesa
vulkan-radeon
vulkan-icd-loader
libva-mesa-driver
mesa-vdpau

# Desktop Environment
i3
dmenu
udisks2
networkmanager
lxsession
alacritty
firefox
lutris
discord
spotify-launcher

# Fonts
gnu-free-fonts
ttf-liberation
noto-fonts
noto-fonts-emoji
noto-fonts-cjk
ttf-jetbrains-mono
ttf-fira-code
ttf-fira-mono
